char[,] map =
{   //x
    {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'}, //y
    {'#', ' ', ' ', '#', 'X', ' ', ' ', '#', ' ', ' ', 'X', ' ', ' ', ' ', '#', 'X', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', '#'},
    {'#', ' ', ' ', '#', '#', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', '#'},
    {'#', ' ', ' ', '+', ' ', ' ', ' ', '#', ' ', ' ', '#', ' ', '+', ' ', '#', ' ', '#'},
    {'#', 'X', ' ', ' ', ' ', '+', ' ', '#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', '#'},
    {'#', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', '#'},
    {'#', ' ', ' ', ' ', ' ', ' ', ' ', '#', 'X', ' ', '#', ' ', ' ', ' ', '#', ' ', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', ' ', '#', ' ', ' ', ' ', ' ', 'X', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', '#', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '#'},
    {'#', ' ', ' ', '#', 'X', ' ', ' ', ' ', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', '#'},
    {'#', ' ', ' ', '#', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', ' ', '#'},
    {'#', ' ', '+', '#', ' ', ' ', ' ', ' ', 'X', ' ', ' ', ' ', ' ', '+', ' ', ' ', '#'},
    {'#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#', '#'},

};

int X = 1, Y = 1, сумка = 0;
Console.CursorVisible = false;
while (true)
{
    Console.SetCursorPosition(0, 18);
    Console.WriteLine("Игра - Бродилка, собери все сокровища в сумку. мяу\n # - Стены\n X - СОКРОВИЩЕ!\n O - ОТКОПАННАЯ ЯМА!\n + - МИНА!!!");

    Console.SetCursorPosition(0, 23);
    Console.Write("Сумка: " + сумка);

    Console.SetCursorPosition(0, 0);
    for (int i = 0; i < map.GetLength(0); i++) 
    {
        for (int j = 0; j < map.GetLength(0); j++)
        {
            Console.Write(map[i, j]);
        }
        Console.WriteLine();
    }
    Console.SetCursorPosition(Y, X);
    Console.Write("@");
    ConsoleKeyInfo Key = Console.ReadKey();
    switch (Key.Key)
    {
        case ConsoleKey.UpArrow:
            if (map[X - 1, Y] != '#')
            { 
                X--;
            }
            break;
        case ConsoleKey.DownArrow:
            if (map[X + 1, Y] != '#')
            {
                X++;
            }
            break;
        case ConsoleKey.LeftArrow:
            if (map[X, Y - 1] != '#')
            {
                Y--;            
            }
            break;
        case ConsoleKey.RightArrow:
            if (map[X, Y + 1] != '#')
            {
                Y++;
            }
            break;
    }
    if (map[X, Y] == 'X')
    {
        map[X, Y] = 'O';
        сумка += 1;
    }
    else if (map[X, Y] == '+')
    {
       
        Console.Clear();
        Console.WriteLine("ВЫ ПОДОРВАНЫ, КОНЕЦ!!!!!!\n гав!");
        break;
    }

    if (сумка == 8)
    {
        Console.Clear();
        Console.WriteLine("Поздравляю, все сокровища собраны! Вы выиграли!\n" + "мяу");
        break;
    }
    Console.Clear();
};
   


